IDEA Open Model
RebarGeneralType Enumeration
Compatible with IDEA StatiCa 20.1
 Determine type of rebar General
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum RebarGeneralType
Public Enumeration RebarGeneralType
Members
Member name | Value | Description
NotDefined | 0 |  Not defined type
Single | 1 |  Rebar Single
Stirrup | 2 |  Rebar Stirrup
See Also
Reference
IdeaRS.OpenModel.Model Namespace